code/openfoam/tutorials/incompressibleDriftFlux/dahl/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentEpsilon];

internalField   uniform 1.50919e-06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    bottomWall
    {
        type            epsilonWallFunction;
        value           $internalField;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }

    endWall
    {
        type            epsilonWallFunction;
        value           $internalField;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }

    top
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
